In [1]:
!pip install pyspark

Requirement already satisfied: pyspark in c:\users\anushka\anaconda3\lib\site-packages (3.5.3)
Requirement already satisfied: py4j==0.10.9.7 in c:\users\anushka\anaconda3\lib\site-packages (from pyspark) (0.10.9.7)

In [2]:
import pyspark

In [3]:
import pandas as pd

In [4]:
df=pd.read_csv("titanic.csv")
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [5]:
type(df)

pandas.core.frame.DataFrame

In [4]:
from pyspark.sql import SparkSession

In [5]:
spark=SparkSession.builder.appName('Practice').getOrCreate()

In [8]:
spark

In [9]:
df_pyspark=spark.read.csv('titanic.csv')

In [10]:
df_pyspark

DataFrame[_c0: string, _c1: string, _c2: string, _c3: string, _c4: string, _c5: string, _c6: string, _c7: string, _c8: string, _c9: string, _c10: string, _c11: string, _c12: string, _c13: string, _c14: string]

In [11]:
df_pyspark.show()

+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|     _c0|   _c1|   _c2| _c3|  _c4|  _c5|    _c6|     _c7|   _c8|  _c9|      _c10|_c11|       _c12| _c13| _c14|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| age|sibsp|parch|   fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
|       0|     3|  male|22.0|    1|    0|   7.25|       S| Third|  man|      True|NULL|Southampton|   no|False|
|       1|     1|female|38.0|    1|    0|71.2833|       C| First|woman|     False|   C|  Cherbourg|  yes|False|
|       1|     3|female|26.0|    0|    0|  7.925|       S| Third|woman|     False|NULL|Southampton|  yes| True|
|       1|     1|female|35.0|    1|    0|   53.1|       S| First|woman|     False|   C|Southampton|  yes|False|
|       0|     3|  male|35.0|    0|    0|   8.05|       S| Third|  man|      True|NULL|Southampton|   no| True|
|       0|     3|  male|NULL|    0|    0| 8.4583|       Q| Third|  man|      True|NULL| Queenstown|   no| True|
|       0|     1|  male|54.0|    0|    0|51.8625|       S| First|  man|      True|   E|Southampton|   no| True|
|       0|     3|  male| 2.0|    3|    1| 21.075|       S| Third|child|     False|NULL|Southampton|   no|False|
|       1|     3|female|27.0|    0|    2|11.1333|       S| Third|woman|     False|NULL|Southampton|  yes|False|
|       1|     2|female|14.0|    1|    0|30.0708|       C|Second|child|     False|NULL|  Cherbourg|  yes|False|
|       1|     3|female| 4.0|    1|    1|   16.7|       S| Third|child|     False|   G|Southampton|  yes|False|
|       1|     1|female|58.0|    0|    0|  26.55|       S| First|woman|     False|   C|Southampton|  yes| True|
|       0|     3|  male|20.0|    0|    0|   8.05|       S| Third|  man|      True|NULL|Southampton|   no| True|
|       0|     3|  male|39.0|    1|    5| 31.275|       S| Third|  man|      True|NULL|Southampton|   no|False|
|       0|     3|female|14.0|    0|    0| 7.8542|       S| Third|child|     False|NULL|Southampton|   no| True|
|       1|     2|female|55.0|    0|    0|   16.0|       S|Second|woman|     False|NULL|Southampton|  yes| True|
|       0|     3|  male| 2.0|    4|    1| 29.125|       Q| Third|child|     False|NULL| Queenstown|   no|False|
|       1|     2|  male|NULL|    0|    0|   13.0|       S|Second|  man|      True|NULL|Southampton|  yes| True|
|       0|     3|female|31.0|    1|    0|   18.0|       S| Third|woman|     False|NULL|Southampton|   no|False|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [12]:
df_pyspark=spark.read.option('header','True').csv('titanic.csv',inferSchema=True)

In [13]:
type(df_pyspark)

pyspark.sql.dataframe.DataFrame

In [14]:
df_pyspark.head()

Row(survived=0, pclass=3, sex='male', age=22.0, sibsp=1, parch=0, fare=7.25, embarked='S', class='Third', who='man', adult_male=True, deck=None, embark_town='Southampton', alive='no', alone=False)

In [15]:
df_pyspark.printSchema()

root
 |-- survived: integer (nullable = true)
 |-- pclass: integer (nullable = true)
 |-- sex: string (nullable = true)
 |-- age: double (nullable = true)
 |-- sibsp: integer (nullable = true)
 |-- parch: integer (nullable = true)
 |-- fare: double (nullable = true)
 |-- embarked: string (nullable = true)
 |-- class: string (nullable = true)
 |-- who: string (nullable = true)
 |-- adult_male: boolean (nullable = true)
 |-- deck: string (nullable = true)
 |-- embark_town: string (nullable = true)
 |-- alive: string (nullable = true)
 |-- alone: boolean (nullable = true)

In [16]:
# from pyspark.sql import SparkSession
# spark=SparkSession.builder.appName('Practice').getOrCreate()
# spark
# df_s=spark.read.option('header','True').csv('titanic.csv')
# df_s.show()

In [17]:
df_pyspark=spark.read.csv('titanic.csv',header=True,inferSchema=True)
df_pyspark.show()

+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| age|sibsp|parch|   fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|       0|     3|  male|22.0|    1|    0|   7.25|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       1|     1|female|38.0|    1|    0|71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|
|       1|     3|female|26.0|    0|    0|  7.925|       S| Third|woman|     false|NULL|Southampton|  yes| true|
|       1|     1|female|35.0|    1|    0|   53.1|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     3|  male|35.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     3|  male|NULL|    0|    0| 8.4583|       Q| Third|  man|      true|NULL| Queenstown|   no| true|
|       0|     1|  male|54.0|    0|    0|51.8625|       S| First|  man|      true|   E|Southampton|   no| true|
|       0|     3|  male| 2.0|    3|    1| 21.075|       S| Third|child|     false|NULL|Southampton|   no|false|
|       1|     3|female|27.0|    0|    2|11.1333|       S| Third|woman|     false|NULL|Southampton|  yes|false|
|       1|     2|female|14.0|    1|    0|30.0708|       C|Second|child|     false|NULL|  Cherbourg|  yes|false|
|       1|     3|female| 4.0|    1|    1|   16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       1|     1|female|58.0|    0|    0|  26.55|       S| First|woman|     false|   C|Southampton|  yes| true|
|       0|     3|  male|20.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     3|  male|39.0|    1|    5| 31.275|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       0|     3|female|14.0|    0|    0| 7.8542|       S| Third|child|     false|NULL|Southampton|   no| true|
|       1|     2|female|55.0|    0|    0|   16.0|       S|Second|woman|     false|NULL|Southampton|  yes| true|
|       0|     3|  male| 2.0|    4|    1| 29.125|       Q| Third|child|     false|NULL| Queenstown|   no|false|
|       1|     2|  male|NULL|    0|    0|   13.0|       S|Second|  man|      true|NULL|Southampton|  yes| true|
|       0|     3|female|31.0|    1|    0|   18.0|       S| Third|woman|     false|NULL|Southampton|   no|false|
|       1|     3|female|NULL|    0|    0|  7.225|       C| Third|woman|     false|NULL|  Cherbourg|  yes| true|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [18]:
#checking the datatype of the columns

df_pyspark.columns #for getting each column names in dataset

['survived',
 'pclass',
 'sex',
 'age',
 'sibsp',
 'parch',
 'fare',
 'embarked',
 'class',
 'who',
 'adult_male',
 'deck',
 'embark_town',
 'alive',
 'alone']

In [19]:
# selecting particular column
df_pyspark.select('age').show()

+----+
| age|
+----+
|22.0|
|38.0|
|26.0|
|35.0|
|35.0|
|NULL|
|54.0|
| 2.0|
|27.0|
|14.0|
| 4.0|
|58.0|
|20.0|
|39.0|
|14.0|
|55.0|
| 2.0|
|NULL|
|31.0|
|NULL|
+----+
only showing top 20 rows

In [20]:
df_pyspark.select(['age','sex']).show()

+----+------+
| age|   sex|
+----+------+
|22.0|  male|
|38.0|female|
|26.0|female|
|35.0|female|
|35.0|  male|
|NULL|  male|
|54.0|  male|
| 2.0|  male|
|27.0|female|
|14.0|female|
| 4.0|female|
|58.0|female|
|20.0|  male|
|39.0|  male|
|14.0|female|
|55.0|female|
| 2.0|  male|
|NULL|  male|
|31.0|female|
|NULL|female|
+----+------+
only showing top 20 rows

In [21]:
df_pyspark['age']

Column<'age'>

In [22]:
df_pyspark.dtypes

[('survived', 'int'),
 ('pclass', 'int'),
 ('sex', 'string'),
 ('age', 'double'),
 ('sibsp', 'int'),
 ('parch', 'int'),
 ('fare', 'double'),
 ('embarked', 'string'),
 ('class', 'string'),
 ('who', 'string'),
 ('adult_male', 'boolean'),
 ('deck', 'string'),
 ('embark_town', 'string'),
 ('alive', 'string'),
 ('alone', 'boolean')]

In [23]:
df_pyspark.describe().show()

+-------+-------------------+------------------+------+------------------+------------------+-------------------+-----------------+--------+-----+-----+----+-----------+-----+
|summary|           survived|            pclass|   sex|               age|             sibsp|              parch|             fare|embarked|class|  who|deck|embark_town|alive|
+-------+-------------------+------------------+------+------------------+------------------+-------------------+-----------------+--------+-----+-----+----+-----------+-----+
|  count|                891|               891|   891|               714|               891|                891|              891|     889|  891|  891| 203|        889|  891|
|   mean| 0.3838383838383838| 2.308641975308642|  NULL| 29.69911764705882|0.5230078563411896|0.38159371492704824| 32.2042079685746|    NULL| NULL| NULL|NULL|       NULL| NULL|
| stddev|0.48659245426485753|0.8360712409770491|  NULL|14.526497332334035|1.1027434322934315| 0.8060572211299488|49.69342859718089|    NULL| NULL| NULL|NULL|       NULL| NULL|
|    min|                  0|                 1|female|              0.42|                 0|                  0|              0.0|       C|First|child|   A|  Cherbourg|   no|
|    max|                  1|                 3|  male|              80.0|                 8|                  6|         512.3292|       S|Third|woman|   G|Southampton|  yes|
+-------+-------------------+------------------+------+------------------+------------------+-------------------+-----------------+--------+-----+-----+----+-----------+-----+

In [24]:
# adding columns in data frame
df_pyspark.withColumn('age in yrs',df_pyspark['age']+1).show()

+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+----------+
|survived|pclass|   sex| age|sibsp|parch|   fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|age in yrs|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+----------+
|       0|     3|  male|22.0|    1|    0|   7.25|       S| Third|  man|      true|NULL|Southampton|   no|false|      23.0|
|       1|     1|female|38.0|    1|    0|71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|      39.0|
|       1|     3|female|26.0|    0|    0|  7.925|       S| Third|woman|     false|NULL|Southampton|  yes| true|      27.0|
|       1|     1|female|35.0|    1|    0|   53.1|       S| First|woman|     false|   C|Southampton|  yes|false|      36.0|
|       0|     3|  male|35.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|      36.0|
|       0|     3|  male|NULL|    0|    0| 8.4583|       Q| Third|  man|      true|NULL| Queenstown|   no| true|      NULL|
|       0|     1|  male|54.0|    0|    0|51.8625|       S| First|  man|      true|   E|Southampton|   no| true|      55.0|
|       0|     3|  male| 2.0|    3|    1| 21.075|       S| Third|child|     false|NULL|Southampton|   no|false|       3.0|
|       1|     3|female|27.0|    0|    2|11.1333|       S| Third|woman|     false|NULL|Southampton|  yes|false|      28.0|
|       1|     2|female|14.0|    1|    0|30.0708|       C|Second|child|     false|NULL|  Cherbourg|  yes|false|      15.0|
|       1|     3|female| 4.0|    1|    1|   16.7|       S| Third|child|     false|   G|Southampton|  yes|false|       5.0|
|       1|     1|female|58.0|    0|    0|  26.55|       S| First|woman|     false|   C|Southampton|  yes| true|      59.0|
|       0|     3|  male|20.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|      21.0|
|       0|     3|  male|39.0|    1|    5| 31.275|       S| Third|  man|      true|NULL|Southampton|   no|false|      40.0|
|       0|     3|female|14.0|    0|    0| 7.8542|       S| Third|child|     false|NULL|Southampton|   no| true|      15.0|
|       1|     2|female|55.0|    0|    0|   16.0|       S|Second|woman|     false|NULL|Southampton|  yes| true|      56.0|
|       0|     3|  male| 2.0|    4|    1| 29.125|       Q| Third|child|     false|NULL| Queenstown|   no|false|       3.0|
|       1|     2|  male|NULL|    0|    0|   13.0|       S|Second|  man|      true|NULL|Southampton|  yes| true|      NULL|
|       0|     3|female|31.0|    1|    0|   18.0|       S| Third|woman|     false|NULL|Southampton|   no|false|      32.0|
|       1|     3|female|NULL|    0|    0|  7.225|       C| Third|woman|     false|NULL|  Cherbourg|  yes| true|      NULL|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+----------+
only showing top 20 rows

In [25]:
## drop the columns
df_pyspark.drop('age in yrs')

DataFrame[survived: int, pclass: int, sex: string, age: double, sibsp: int, parch: int, fare: double, embarked: string, class: string, who: string, adult_male: boolean, deck: string, embark_town: string, alive: string, alone: boolean]

In [26]:
df_pyspark.show()

+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| age|sibsp|parch|   fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|       0|     3|  male|22.0|    1|    0|   7.25|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       1|     1|female|38.0|    1|    0|71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|
|       1|     3|female|26.0|    0|    0|  7.925|       S| Third|woman|     false|NULL|Southampton|  yes| true|
|       1|     1|female|35.0|    1|    0|   53.1|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     3|  male|35.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     3|  male|NULL|    0|    0| 8.4583|       Q| Third|  man|      true|NULL| Queenstown|   no| true|
|       0|     1|  male|54.0|    0|    0|51.8625|       S| First|  man|      true|   E|Southampton|   no| true|
|       0|     3|  male| 2.0|    3|    1| 21.075|       S| Third|child|     false|NULL|Southampton|   no|false|
|       1|     3|female|27.0|    0|    2|11.1333|       S| Third|woman|     false|NULL|Southampton|  yes|false|
|       1|     2|female|14.0|    1|    0|30.0708|       C|Second|child|     false|NULL|  Cherbourg|  yes|false|
|       1|     3|female| 4.0|    1|    1|   16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       1|     1|female|58.0|    0|    0|  26.55|       S| First|woman|     false|   C|Southampton|  yes| true|
|       0|     3|  male|20.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     3|  male|39.0|    1|    5| 31.275|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       0|     3|female|14.0|    0|    0| 7.8542|       S| Third|child|     false|NULL|Southampton|   no| true|
|       1|     2|female|55.0|    0|    0|   16.0|       S|Second|woman|     false|NULL|Southampton|  yes| true|
|       0|     3|  male| 2.0|    4|    1| 29.125|       Q| Third|child|     false|NULL| Queenstown|   no|false|
|       1|     2|  male|NULL|    0|    0|   13.0|       S|Second|  man|      true|NULL|Southampton|  yes| true|
|       0|     3|female|31.0|    1|    0|   18.0|       S| Third|woman|     false|NULL|Southampton|   no|false|
|       1|     3|female|NULL|    0|    0|  7.225|       C| Third|woman|     false|NULL|  Cherbourg|  yes| true|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [27]:
# rename columns
df_pyspark=df_pyspark.withColumnRenamed('age','Age')
df_pyspark.show()

+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| Age|sibsp|parch|   fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|       0|     3|  male|22.0|    1|    0|   7.25|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       1|     1|female|38.0|    1|    0|71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|
|       1|     3|female|26.0|    0|    0|  7.925|       S| Third|woman|     false|NULL|Southampton|  yes| true|
|       1|     1|female|35.0|    1|    0|   53.1|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     3|  male|35.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     3|  male|NULL|    0|    0| 8.4583|       Q| Third|  man|      true|NULL| Queenstown|   no| true|
|       0|     1|  male|54.0|    0|    0|51.8625|       S| First|  man|      true|   E|Southampton|   no| true|
|       0|     3|  male| 2.0|    3|    1| 21.075|       S| Third|child|     false|NULL|Southampton|   no|false|
|       1|     3|female|27.0|    0|    2|11.1333|       S| Third|woman|     false|NULL|Southampton|  yes|false|
|       1|     2|female|14.0|    1|    0|30.0708|       C|Second|child|     false|NULL|  Cherbourg|  yes|false|
|       1|     3|female| 4.0|    1|    1|   16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       1|     1|female|58.0|    0|    0|  26.55|       S| First|woman|     false|   C|Southampton|  yes| true|
|       0|     3|  male|20.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     3|  male|39.0|    1|    5| 31.275|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       0|     3|female|14.0|    0|    0| 7.8542|       S| Third|child|     false|NULL|Southampton|   no| true|
|       1|     2|female|55.0|    0|    0|   16.0|       S|Second|woman|     false|NULL|Southampton|  yes| true|
|       0|     3|  male| 2.0|    4|    1| 29.125|       Q| Third|child|     false|NULL| Queenstown|   no|false|
|       1|     2|  male|NULL|    0|    0|   13.0|       S|Second|  man|      true|NULL|Southampton|  yes| true|
|       0|     3|female|31.0|    1|    0|   18.0|       S| Third|woman|     false|NULL|Southampton|   no|false|
|       1|     3|female|NULL|    0|    0|  7.225|       C| Third|woman|     false|NULL|  Cherbourg|  yes| true|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [28]:
#dropping rows
df_pyspark.na.drop().show() #deletes all the rows with null value

+--------+------+------+----+-----+-----+--------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| Age|sibsp|parch|    fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+--------+--------+------+-----+----------+----+-----------+-----+-----+
|       1|     1|female|38.0|    1|    0| 71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|
|       1|     1|female|35.0|    1|    0|    53.1|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     1|  male|54.0|    0|    0| 51.8625|       S| First|  man|      true|   E|Southampton|   no| true|
|       1|     3|female| 4.0|    1|    1|    16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       1|     1|female|58.0|    0|    0|   26.55|       S| First|woman|     false|   C|Southampton|  yes| true|
|       1|     2|  male|34.0|    0|    0|    13.0|       S|Second|  man|      true|   D|Southampton|  yes| true|
|       1|     1|  male|28.0|    0|    0|    35.5|       S| First|  man|      true|   A|Southampton|  yes| true|
|       0|     1|  male|19.0|    3|    2|   263.0|       S| First|  man|      true|   C|Southampton|   no|false|
|       1|     1|female|49.0|    1|    0| 76.7292|       C| First|woman|     false|   D|  Cherbourg|  yes|false|
|       0|     1|  male|65.0|    0|    1| 61.9792|       C| First|  man|      true|   B|  Cherbourg|   no|false|
|       0|     1|  male|45.0|    1|    0|  83.475|       S| First|  man|      true|   C|Southampton|   no|false|
|       1|     2|female|29.0|    0|    0|    10.5|       S|Second|woman|     false|   F|Southampton|  yes| true|
|       0|     3|  male|25.0|    0|    0|    7.65|       S| Third|  man|      true|   F|Southampton|   no| true|
|       1|     1|female|23.0|    3|    2|   263.0|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     1|  male|46.0|    1|    0|  61.175|       S| First|  man|      true|   E|Southampton|   no|false|
|       0|     1|  male|71.0|    0|    0| 34.6542|       C| First|  man|      true|   A|  Cherbourg|   no| true|
|       1|     1|  male|23.0|    0|    1| 63.3583|       C| First|  man|      true|   D|  Cherbourg|  yes|false|
|       0|     1|  male|21.0|    0|    1| 77.2875|       S| First|  man|      true|   D|Southampton|   no|false|
|       0|     1|  male|47.0|    0|    0|    52.0|       S| First|  man|      true|   C|Southampton|   no| true|
|       0|     1|  male|24.0|    0|    1|247.5208|       C| First|  man|      true|   B|  Cherbourg|   no|false|
+--------+------+------+----+-----+-----+--------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [29]:
## any==how
df_pyspark.na.drop(how='any').show()

+--------+------+------+----+-----+-----+--------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| Age|sibsp|parch|    fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+--------+--------+------+-----+----------+----+-----------+-----+-----+
|       1|     1|female|38.0|    1|    0| 71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|
|       1|     1|female|35.0|    1|    0|    53.1|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     1|  male|54.0|    0|    0| 51.8625|       S| First|  man|      true|   E|Southampton|   no| true|
|       1|     3|female| 4.0|    1|    1|    16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       1|     1|female|58.0|    0|    0|   26.55|       S| First|woman|     false|   C|Southampton|  yes| true|
|       1|     2|  male|34.0|    0|    0|    13.0|       S|Second|  man|      true|   D|Southampton|  yes| true|
|       1|     1|  male|28.0|    0|    0|    35.5|       S| First|  man|      true|   A|Southampton|  yes| true|
|       0|     1|  male|19.0|    3|    2|   263.0|       S| First|  man|      true|   C|Southampton|   no|false|
|       1|     1|female|49.0|    1|    0| 76.7292|       C| First|woman|     false|   D|  Cherbourg|  yes|false|
|       0|     1|  male|65.0|    0|    1| 61.9792|       C| First|  man|      true|   B|  Cherbourg|   no|false|
|       0|     1|  male|45.0|    1|    0|  83.475|       S| First|  man|      true|   C|Southampton|   no|false|
|       1|     2|female|29.0|    0|    0|    10.5|       S|Second|woman|     false|   F|Southampton|  yes| true|
|       0|     3|  male|25.0|    0|    0|    7.65|       S| Third|  man|      true|   F|Southampton|   no| true|
|       1|     1|female|23.0|    3|    2|   263.0|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     1|  male|46.0|    1|    0|  61.175|       S| First|  man|      true|   E|Southampton|   no|false|
|       0|     1|  male|71.0|    0|    0| 34.6542|       C| First|  man|      true|   A|  Cherbourg|   no| true|
|       1|     1|  male|23.0|    0|    1| 63.3583|       C| First|  man|      true|   D|  Cherbourg|  yes|false|
|       0|     1|  male|21.0|    0|    1| 77.2875|       S| First|  man|      true|   D|Southampton|   no|false|
|       0|     1|  male|47.0|    0|    0|    52.0|       S| First|  man|      true|   C|Southampton|   no| true|
|       0|     1|  male|24.0|    0|    1|247.5208|       C| First|  man|      true|   B|  Cherbourg|   no|false|
+--------+------+------+----+-----+-----+--------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [30]:
# threshold
# df_pyspark.na.drop(how='any',thresh=2).show()
df_pyspark.na.drop(how='any',subset=['Age']).show() # deletes every null value from age column

+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| Age|sibsp|parch|   fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|       0|     3|  male|22.0|    1|    0|   7.25|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       1|     1|female|38.0|    1|    0|71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|
|       1|     3|female|26.0|    0|    0|  7.925|       S| Third|woman|     false|NULL|Southampton|  yes| true|
|       1|     1|female|35.0|    1|    0|   53.1|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     3|  male|35.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     1|  male|54.0|    0|    0|51.8625|       S| First|  man|      true|   E|Southampton|   no| true|
|       0|     3|  male| 2.0|    3|    1| 21.075|       S| Third|child|     false|NULL|Southampton|   no|false|
|       1|     3|female|27.0|    0|    2|11.1333|       S| Third|woman|     false|NULL|Southampton|  yes|false|
|       1|     2|female|14.0|    1|    0|30.0708|       C|Second|child|     false|NULL|  Cherbourg|  yes|false|
|       1|     3|female| 4.0|    1|    1|   16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       1|     1|female|58.0|    0|    0|  26.55|       S| First|woman|     false|   C|Southampton|  yes| true|
|       0|     3|  male|20.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     3|  male|39.0|    1|    5| 31.275|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       0|     3|female|14.0|    0|    0| 7.8542|       S| Third|child|     false|NULL|Southampton|   no| true|
|       1|     2|female|55.0|    0|    0|   16.0|       S|Second|woman|     false|NULL|Southampton|  yes| true|
|       0|     3|  male| 2.0|    4|    1| 29.125|       Q| Third|child|     false|NULL| Queenstown|   no|false|
|       0|     3|female|31.0|    1|    0|   18.0|       S| Third|woman|     false|NULL|Southampton|   no|false|
|       0|     2|  male|35.0|    0|    0|   26.0|       S|Second|  man|      true|NULL|Southampton|   no| true|
|       1|     2|  male|34.0|    0|    0|   13.0|       S|Second|  man|      true|   D|Southampton|  yes| true|
|       1|     3|female|15.0|    0|    0| 8.0292|       Q| Third|child|     false|NULL| Queenstown|  yes| true|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [31]:
# filling the missing value
df_pyspark.na.fill('0','Age').show()

+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| Age|sibsp|parch|   fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|       0|     3|  male|22.0|    1|    0|   7.25|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       1|     1|female|38.0|    1|    0|71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|
|       1|     3|female|26.0|    0|    0|  7.925|       S| Third|woman|     false|NULL|Southampton|  yes| true|
|       1|     1|female|35.0|    1|    0|   53.1|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     3|  male|35.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     3|  male|NULL|    0|    0| 8.4583|       Q| Third|  man|      true|NULL| Queenstown|   no| true|
|       0|     1|  male|54.0|    0|    0|51.8625|       S| First|  man|      true|   E|Southampton|   no| true|
|       0|     3|  male| 2.0|    3|    1| 21.075|       S| Third|child|     false|NULL|Southampton|   no|false|
|       1|     3|female|27.0|    0|    2|11.1333|       S| Third|woman|     false|NULL|Southampton|  yes|false|
|       1|     2|female|14.0|    1|    0|30.0708|       C|Second|child|     false|NULL|  Cherbourg|  yes|false|
|       1|     3|female| 4.0|    1|    1|   16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       1|     1|female|58.0|    0|    0|  26.55|       S| First|woman|     false|   C|Southampton|  yes| true|
|       0|     3|  male|20.0|    0|    0|   8.05|       S| Third|  man|      true|NULL|Southampton|   no| true|
|       0|     3|  male|39.0|    1|    5| 31.275|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       0|     3|female|14.0|    0|    0| 7.8542|       S| Third|child|     false|NULL|Southampton|   no| true|
|       1|     2|female|55.0|    0|    0|   16.0|       S|Second|woman|     false|NULL|Southampton|  yes| true|
|       0|     3|  male| 2.0|    4|    1| 29.125|       Q| Third|child|     false|NULL| Queenstown|   no|false|
|       1|     2|  male|NULL|    0|    0|   13.0|       S|Second|  man|      true|NULL|Southampton|  yes| true|
|       0|     3|female|31.0|    1|    0|   18.0|       S| Third|woman|     false|NULL|Southampton|   no|false|
|       1|     3|female|NULL|    0|    0|  7.225|       C| Third|woman|     false|NULL|  Cherbourg|  yes| true|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [32]:
# # replacing null values with mean value
# from pyspark.ml.feature import Imputer

# imputer=Imputer(
#     inputCols=['Age'],
#     outputCols=["{}_inputed".format(c) for c in ['Age']]).setStrategy("mean")

## filtering

In [33]:
# age greater than 18 
df_pyspark.filter("Age<18").show()

+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| Age|sibsp|parch|   fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
|       0|     3|  male| 2.0|    3|    1| 21.075|       S| Third|child|     false|NULL|Southampton|   no|false|
|       1|     2|female|14.0|    1|    0|30.0708|       C|Second|child|     false|NULL|  Cherbourg|  yes|false|
|       1|     3|female| 4.0|    1|    1|   16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       0|     3|female|14.0|    0|    0| 7.8542|       S| Third|child|     false|NULL|Southampton|   no| true|
|       0|     3|  male| 2.0|    4|    1| 29.125|       Q| Third|child|     false|NULL| Queenstown|   no|false|
|       1|     3|female|15.0|    0|    0| 8.0292|       Q| Third|child|     false|NULL| Queenstown|  yes| true|
|       0|     3|female| 8.0|    3|    1| 21.075|       S| Third|child|     false|NULL|Southampton|   no|false|
|       1|     3|female|14.0|    1|    0|11.2417|       C| Third|child|     false|NULL|  Cherbourg|  yes|false|
|       1|     2|female| 3.0|    1|    2|41.5792|       C|Second|child|     false|NULL|  Cherbourg|  yes|false|
|       0|     3|  male| 7.0|    4|    1|39.6875|       S| Third|child|     false|NULL|Southampton|   no|false|
|       1|     2|female| 5.0|    1|    2|  27.75|       S|Second|child|     false|NULL|Southampton|  yes|false|
|       0|     3|  male|11.0|    5|    2|   46.9|       S| Third|child|     false|NULL|Southampton|   no|false|
|       0|     3|  male| 4.0|    3|    2|   27.9|       S| Third|child|     false|NULL|Southampton|   no|false|
|       1|     3|female|17.0|    4|    2|  7.925|       S| Third|woman|     false|NULL|Southampton|  yes|false|
|       0|     3|female|16.0|    5|    2|   46.9|       S| Third|woman|     false|NULL|Southampton|   no|false|
|       1|     2|  male|0.83|    0|    2|   29.0|       S|Second|child|     false|NULL|Southampton|  yes|false|
|       1|     2|female|17.0|    0|    0|   10.5|       S|Second|woman|     false|NULL|Southampton|  yes| true|
|       0|     3|  male|16.0|    1|    3| 34.375|       S| Third|  man|      true|NULL|Southampton|   no|false|
|       0|     3|female|14.5|    1|    0|14.4542|       C| Third|child|     false|NULL|  Cherbourg|   no|false|
|       0|     3|female|17.0|    0|    0|14.4583|       C| Third|woman|     false|NULL|  Cherbourg|   no| true|
+--------+------+------+----+-----+-----+-------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [34]:
df_pyspark.filter('Age<18').select(['survived','Age','sex']).show()

+--------+----+------+
|survived| Age|   sex|
+--------+----+------+
|       0| 2.0|  male|
|       1|14.0|female|
|       1| 4.0|female|
|       0|14.0|female|
|       0| 2.0|  male|
|       1|15.0|female|
|       0| 8.0|female|
|       1|14.0|female|
|       1| 3.0|female|
|       0| 7.0|  male|
|       1| 5.0|female|
|       0|11.0|  male|
|       0| 4.0|  male|
|       1|17.0|female|
|       0|16.0|female|
|       1|0.83|  male|
|       1|17.0|female|
|       0|16.0|  male|
|       0|14.5|female|
|       0|17.0|female|
+--------+----+------+
only showing top 20 rows

In [35]:
df_pyspark.filter('Age <= 18' and 'survived > 0').select(['Age','survived']).show()

+----+--------+
| Age|survived|
+----+--------+
|38.0|       1|
|26.0|       1|
|35.0|       1|
|27.0|       1|
|14.0|       1|
| 4.0|       1|
|58.0|       1|
|55.0|       1|
|NULL|       1|
|NULL|       1|
|34.0|       1|
|15.0|       1|
|28.0|       1|
|38.0|       1|
|NULL|       1|
|NULL|       1|
|NULL|       1|
|NULL|       1|
|14.0|       1|
| 3.0|       1|
+----+--------+
only showing top 20 rows

In [36]:
df_spark=df_pyspark.na.drop().show()

+--------+------+------+----+-----+-----+--------+--------+------+-----+----------+----+-----------+-----+-----+
|survived|pclass|   sex| Age|sibsp|parch|    fare|embarked| class|  who|adult_male|deck|embark_town|alive|alone|
+--------+------+------+----+-----+-----+--------+--------+------+-----+----------+----+-----------+-----+-----+
|       1|     1|female|38.0|    1|    0| 71.2833|       C| First|woman|     false|   C|  Cherbourg|  yes|false|
|       1|     1|female|35.0|    1|    0|    53.1|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     1|  male|54.0|    0|    0| 51.8625|       S| First|  man|      true|   E|Southampton|   no| true|
|       1|     3|female| 4.0|    1|    1|    16.7|       S| Third|child|     false|   G|Southampton|  yes|false|
|       1|     1|female|58.0|    0|    0|   26.55|       S| First|woman|     false|   C|Southampton|  yes| true|
|       1|     2|  male|34.0|    0|    0|    13.0|       S|Second|  man|      true|   D|Southampton|  yes| true|
|       1|     1|  male|28.0|    0|    0|    35.5|       S| First|  man|      true|   A|Southampton|  yes| true|
|       0|     1|  male|19.0|    3|    2|   263.0|       S| First|  man|      true|   C|Southampton|   no|false|
|       1|     1|female|49.0|    1|    0| 76.7292|       C| First|woman|     false|   D|  Cherbourg|  yes|false|
|       0|     1|  male|65.0|    0|    1| 61.9792|       C| First|  man|      true|   B|  Cherbourg|   no|false|
|       0|     1|  male|45.0|    1|    0|  83.475|       S| First|  man|      true|   C|Southampton|   no|false|
|       1|     2|female|29.0|    0|    0|    10.5|       S|Second|woman|     false|   F|Southampton|  yes| true|
|       0|     3|  male|25.0|    0|    0|    7.65|       S| Third|  man|      true|   F|Southampton|   no| true|
|       1|     1|female|23.0|    3|    2|   263.0|       S| First|woman|     false|   C|Southampton|  yes|false|
|       0|     1|  male|46.0|    1|    0|  61.175|       S| First|  man|      true|   E|Southampton|   no|false|
|       0|     1|  male|71.0|    0|    0| 34.6542|       C| First|  man|      true|   A|  Cherbourg|   no| true|
|       1|     1|  male|23.0|    0|    1| 63.3583|       C| First|  man|      true|   D|  Cherbourg|  yes|false|
|       0|     1|  male|21.0|    0|    1| 77.2875|       S| First|  man|      true|   D|Southampton|   no|false|
|       0|     1|  male|47.0|    0|    0|    52.0|       S| First|  man|      true|   C|Southampton|   no| true|
|       0|     1|  male|24.0|    0|    1|247.5208|       C| First|  man|      true|   B|  Cherbourg|   no|false|
+--------+------+------+----+-----+-----+--------+--------+------+-----+----------+----+-----------+-----+-----+
only showing top 20 rows

In [37]:
df_pyspark.filter((df_pyspark['Age'] < 18) & (df_pyspark['sex'] == 'male')).select(['Age','survived','sex']).show()

+----+--------+----+
| Age|survived| sex|
+----+--------+----+
| 2.0|       0|male|
| 2.0|       0|male|
| 7.0|       0|male|
|11.0|       0|male|
| 4.0|       0|male|
|0.83|       1|male|
|16.0|       0|male|
|12.0|       1|male|
|16.0|       0|male|
|17.0|       0|male|
| 1.0|       0|male|
| 9.0|       1|male|
| 4.0|       0|male|
| 9.0|       0|male|
| 1.0|       1|male|
| 3.0|       1|male|
|16.0|       1|male|
| 3.0|       1|male|
|16.0|       0|male|
| 7.0|       0|male|
+----+--------+----+
only showing top 20 rows

In [9]:
sp=SparkSession.builder.appName('agg').getOrCreate()
sp

In [14]:
df=sp.read.csv('academic_data.csv',header=True,inferSchema=True)
df.show()

+---------+--------+------+-----+-----+----+---+
|Firstname|Lastname|Gender| SPOS|DSBDA|  WT| DA|
+---------+--------+------+-----+-----+----+---+
|       LA|     Roy|     M| 85.0|   88|  90| 92|
|       SA|   Dixit|     F| 90.0|   90|  94| 95|
|       AB|  Danial|     M|  NaN|   na| 100| 80|
|       DA|  Kapoor|     M| 95.0|   86| 500| 82|
|       SA|     Jha|     F|  NaN|   84|  98| 84|
|       WS|  Thakur|     F| 87.0|  NaN|  97| 86|
|       DY|  Kapoor|     M| 81.0|   80|  96| 89|
|       JK|  Khanna|     F| 40.0|   88|  95| 87|
|       RT| Pardesi|     M| 10.0|   96|  94| 88|
|       UV| Pardesi|     M|  9.0|   NA|  93| 96|
|       MN|   Desai|     F|200.0|   87|NULL|N.A|
|       BC|   Patel|     F|300.0|  N/A|  88|300|
+---------+--------+------+-----+-----+----+---+

In [10]:
df=df.fillna(0).show()

+---------+--------+------+-----+-----+---+---+
|Firstname|Lastname|Gender| SPOS|DSBDA| WT| DA|
+---------+--------+------+-----+-----+---+---+
|       LA|     Roy|     M| 85.0|   88| 90| 92|
|       SA|   Dixit|     F| 90.0|   90| 94| 95|
|       AB|  Danial|     M|  0.0|   na|100| 80|
|       DA|  Kapoor|     M| 95.0|   86|500| 82|
|       SA|     Jha|     F|  0.0|   84| 98| 84|
|       WS|  Thakur|     F| 87.0|  NaN| 97| 86|
|       DY|  Kapoor|     M| 81.0|   80| 96| 89|
|       JK|  Khanna|     F| 40.0|   88| 95| 87|
|       RT| Pardesi|     M| 10.0|   96| 94| 88|
|       UV| Pardesi|     M|  9.0|   NA| 93| 96|
|       MN|   Desai|     F|200.0|   87|  0|N.A|
|       BC|   Patel|     F|300.0|  N/A| 88|300|
+---------+--------+------+-----+-----+---+---+

In [21]:
#groupby
df.groupby('Firstname').sum().show() # will be applied only if the table is normalized or is in 1nf

+---------+---------+-------+
|Firstname|sum(SPOS)|sum(WT)|
+---------+---------+-------+
|       LA|     85.0|     90|
|       MN|    200.0|   NULL|
|       UV|      9.0|     93|
|       BC|    300.0|     88|
|       SA|      NaN|    192|
|       DY|     81.0|     96|
|       DA|     95.0|    500|
|       WS|     87.0|     97|
|       AB|      NaN|    100|
|       JK|     40.0|     95|
|       RT|     10.0|     94|
+---------+---------+-------+

In [22]:
df.groupby('Lastname').max().show()

+--------+---------+-------+
|Lastname|max(SPOS)|max(WT)|
+--------+---------+-------+
|     Roy|     85.0|     90|
|   Desai|    200.0|   NULL|
|     Jha|      NaN|     98|
|  Danial|      NaN|    100|
|  Khanna|     40.0|     95|
| Pardesi|     10.0|     94|
|  Kapoor|     95.0|    500|
|   Dixit|     90.0|     94|
|   Patel|    300.0|     88|
|  Thakur|     87.0|     97|
+--------+---------+-------+

In [24]:
df.agg({'WT':'sum'}).show()

+-------+
|sum(WT)|
+-------+
|   1445|
+-------+